Repository: seekode/seekode-old-flutter
Catalog: lib/l10n/app_*.arb
Languages: fr

source: About me
fr: A propos

# activityDevelopment
source: Take advantage of my experience to help you in the management and development of your project. Website, mobile application, software, or training, I offer high quality services that will satisfy you.
fr: Profitez de mon expérience pour vous aider dans la gestion et le développement de votre projet. Site web, application mobile, logiciel, ou encore formation, je propose des services de haute qualité qui seront vous satisfaire.

# activityTrainings
source: Discover the profession of developer with my tailor-made training adapted to your level and your objectives. Whether you want to create websites, develop mobile applications or design software, I am here to support you in your project.
fr: Découvrez le métier de développeur avec mes formations sur mesures adaptées à votre niveau et à vos objectifs. Que vous souhaitiez créer des sites web, développer des applications mobiles ou concevoir des logiciels, je suis là pour vous accompagner dans votre projet.

source: back
fr: retour

source: Development
fr: Développement freelance

source: Discover
fr: Découvrir

# featureInDev
source: Feature in development
fr: Fonctionnalité en développement

# headerContent
source: Development & Training
fr: Développement & Formations

# headerExperiences
source: 7 years of experience
fr: ans d'éxperiences

# headerSubtitle
source: Independent developer
fr: Développeur indépendant

# key
source: en
fr: fr

# language
source: English
fr: Français

# reviewAvenueDelaCommunication
source: An excellent developer, Nicolas is highly professional, and you can entrust him with all kinds of assignments with complete confidence. He'll be able to meet your expectations quickly.
fr: Excellent développeur, Nicolas fait preuve d'un grand professionnalisme, vous pouvez lui confier toutes sortes de missions en toute confiance, il saura vous répondre à vos attentes rapidement.

# reviewDumasPascal
source: Nicolas was always quick and efficient. I highly recommend him for your projects and follow-ups.
fr: Nicolas a toujours été d une aide rapide et efficace. Je le recommande vivement pour vos projets et suivis.

# reviewEmmanuelleCuminal
source: I contacted Nicolas to improve my website and he was very efficient and professional. He is reactive and gives a lot of advice, I recommend!
fr: J'ai fait appel à Nicolas pour améliorer mon site internet et il a été très efficace et professionnel. Il est réactif et donne de nombreux conseils, je recommande !

# servicesCoachSubtitle
source: Coaching & Training
fr: Coaching & Formations

# servicesItem1Title
source: An application that adapts!
fr: Une application qui s'adapte!

# servicesItem1text
source: A design that adapts to all screen sizes for a wider target
fr: Un design qui s'adapte à toutes les tailles d'écrans pour une cible plus large

# servicesItem2Text
source: A fully customizable design adapted to your needs
fr: Un design entièrement personnalisable et adapté à vos besoins

# servicesItem2Title
source: A coherent design!
fr: Un design cohérent!

# servicesItem3Text
source: A work done by a passionate person who will show you what he is capable of
fr: Un travail effectué par un passionné qui saura vous montrer de quoi il est capable

# servicesItem3Title
source: Serious and quality work!
fr: Un travail sérieux et de qualité!

# servicesItem4Text
source: Take advantage of the advice that my skills and experiences can bring you
fr: Profiter des conseils que mes compétences et mes expériences peuvent vous apporter

# servicesItem4Title
source: Sound advice!
fr: Des conseils avisés !

# servicesItem5Text
source: Working with a flexible developer is available during and after your project
fr: Travailler avec un développeur flexible est disponible pendant et après votre projet

# servicesItem5Title
source: Seamless communication!
fr: Une communication sans faille!

# servicesItem6Text
source: Be happy with the result and the support offered
fr: Être content du résultat et de l'accompagnement proposé

# servicesItem6Title
source: Satisfaction guaranteed!
fr: Une satisfaction garantie!

# servicesProjectSubtitle
source: Project management
fr: Gestion de projets

# servicesTitle
source: My services
fr: Mes services

# servicesWorkWithMeTitle
source: Working with me mean...
fr: Travailler avec moi c'est...

# techAndroidStudio
source: Android Studio is a development environment for developing Android mobile applications. It is based on IntelliJ IDEA and uses the Gradle production engine.
fr: Android Studio est un environnement de développement pour développer des applications mobiles Android. Il est basé sur IntelliJ IDEA et utilise le moteur de production Gradle.

# techCss
source: Cascading Style Sheets, commonly referred to as Cascading Style Sheets, are a computer language that describes the presentation of HTML and XML documents.
fr: Les feuilles de style en cascade, généralement appelées CSS de l'anglais Cascading Style Sheets, forment un langage informatique qui décrit la présentation des documents HTML et XML.

# techDart
source: Dart is a programming language optimized for applications on multiple platforms. It is developed by Google and is used to create mobile, desktop, server and web applications.
fr: Dart est un langage de programmation optimisé pour les applications sur plusieurs plateformes. Il est développé par Google et est utilisé pour créer des applications mobiles, de bureau, de serveur et web.

# techFigma
source: Figma is a collaborative web application for interface design, with additional offline features enabled by desktop applications for macOS and Windows.
fr: Figma est un éditeur de graphiques vectoriels et un outil de prototypage. Il est principalement basé sur le web, avec des fonctionnalités hors ligne supplémentaires activées par des applications de bureau pour macOS et Windows.

# techFilezilla
source: FileZilla Client (FileZilla) is an FTP, FTPS and SFTP client, developed under the GNU General Public License. It is included in the list of free software recommended by the French State as part of the overall modernization of its information systems (IS).
fr: FileZilla Client (FileZilla) est un client FTP, FTPS et SFTP, développé sous la licence publique générale GNU. Il est intégré à la liste des logiciels libres préconisés par l’État français dans le cadre de la modernisation globale de ses systèmes d’informations (S.I.).

# techFirebase
source: Firebase is a set of tools for hosting and developing mobile and web applications, which allows sending notifications and advertisements, hosting a website and database, as well as various other tools for a very affordable price.
fr: Firebase est un ensemble d'outils pour l'hébergement et le développement d'applications mobiles et web, qui permet l'envoi de notifications et de publicités, l'hébergement d'un site web et d'une base de données, ainsi que diverses autres outils pour un tarifs très abordable.

# techFlutter
source: Flutter is an open-source UI software development kit created by Google. It is used to develop cross-platform applications for Android, iOS, Linux, macOS, Windows, Google Fuchsia, and the web from a single codebase.
fr: Flutter est un kit de développement logiciel (SDK) d'interface utilisateur open-source créé par Google. Il est utilisé pour développer des applications pour Android, iOS, Linux, Mac, Windows, Google Fuchsia et le web à partir d'une seule base de code.

# techGit
source: Git is a decentralized version control software. It is free and open source software, created in 2005 by Linus Torvalds, author of the Linux kernel, and distributed under the terms of the GNU General Public License version 2.
fr: Git est un logiciel de gestion de versions décentralisé. C'est un logiciel libre et gratuit, créé en 2005 par Linus Torvalds, auteur du noyau Linux, et distribué selon les termes de la licence publique générale GNU version 2.

# techGithub
source: GitHub is a web service for hosting and managing software development, using Git version control software.
fr: GitHub est un service web d'hébergement et de gestion de développement de logiciels, utilisant le logiciel de gestion de versions Git.

# techHtml
source: HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript).
fr: HTML signifie « HyperText Markup Language » qu'on peut traduire par « langage de balises pour l'hypertexte ». Il est utilisé afin de créer et de représenter le contenu d'une page web et sa structure. D'autres technologies sont utilisées avec HTML pour décrire la présentation d'une page (CSS) et/ou ses fonctionnalités interactives (JavaScript).

# techJavascript
source: JavaScript is a scripting programming language primarily used in interactive web pages and as such is an essential part of web applications. Along with HTML and CSS, JavaScript is at the heart of the languages used by web developers.
fr: JavaScript est un langage de programmation de scripts principalement employé dans les pages web interactives et à ce titre est une partie essentielle des applications web. Avec les langages HTML et CSS, JavaScript est au cœur des langages utilisés par les développeurs web.

# techMongoDB
source: MongoDB is a document-oriented database management system that can be distributed across any number of computers and does not require a predefined data schema.
fr: MongoDB est un système de gestion de base de données orienté documents, répartissable sur un nombre quelconque d'ordinateurs et ne nécessitant pas de schéma prédéfini des données.

# techMySql
source: MySQL is a relational database management system (RDBMS). It is distributed under a dual GPL and proprietary license. It is one of the most widely used database management software in the world.
fr: MySQL est un système de gestion de bases de données relationnelles (SGBDR). Il est distribué sous une double licence GPL et propriétaire. Il fait partie des logiciels de gestion de base de données les plus utilisés au monde.

# techNodejs
source: Node.js is a free software platform in JavaScript, oriented towards highly competitive event-driven network applications that must be able to scale out.
fr: Node.js est une plateforme logicielle libre en JavaScript, orientée vers les applications réseau évènementielles hautement concurrentes qui doivent pouvoir monter en charge.

# techPhp
source: PHP is a free programming language, mainly used to produce dynamic web pages via a web server, but can also work like any locally interpreted language.
fr: PHP est un langage de programmation libre, principalement utilisé pour produire des pages Web dynamiques via un serveur web, mais pouvant également fonctionner comme n'importe quel langage interprété de façon locale.

# techResponsive
source: Responsive web design (RWD) or responsive design is an approach to web design that aims to make web pages render well on a variety of devices and window or screen sizes from minimum to maximum display size to ensure usability and satisfaction.
fr: La conception réactive est une approche de la conception Web / application qui vise à rendre les site web / applications bien rendues sur une variété d’appareils et de tailles d’écran différents afin d'assurer la convivialité et la satisfaction.

# techSass
source: Sass (Syntactically awesome stylesheets) is a preprocessor scripting language that is compiled or interpreted in CSS (Cascading Style Sheets). SassScript is the scripting language itself.
fr: Sass (Syntactically awesome stylesheets) est un langage de script préprocesseur qui est compilé ou interprété en CSS (Cascading Style Sheets). SassScript est le langage de script en lui-même.

# techTeams
source: Microsoft Teams is a proprietary SaaS collaborative communication application officially launched by Microsoft in November 2016.
fr: Microsoft Teams est une application de communication collaborative propriétaire en mode SaaS officiellement lancée par Microsoft en novembre 2016.

# techTrello
source: Trello is an online project management tool, launched in September 2011 and inspired by Toyota's Kanban method. It is based on an organization of projects in boards listing cards, each representing tasks. The cards are assignable to users and are mobile from one board to another, reflecting their progress.
fr: Trello est un outil de gestion de projet en ligne, lancé en septembre 2011 et inspiré par la méthode Kanban de Toyota. Il repose sur une organisation des projets en planches listant des cartes, chacune représentant des tâches. Les cartes sont assignables à des utilisateurs et sont mobiles d'une planche à l'autre, traduisant leur avancement.

# techVsc
source: Visual Studio Code is an extensible code editor developed by Microsoft for Windows, Linux, and macOS.
fr: Visual Studio Code est un éditeur de code extensible développé par Microsoft pour Windows, Linux et macOS.

source: Trainings
fr: Formations

# trainingsDiscord
source: A discord server is available so you can contact me quickly for projects or a need for help in development
fr: Un serveur discord est mis à disposition afin de pouvoir me contacter rapidement pour des projets ou un besoin d'aide dans le développement.

# trainingsSeeLearn
source: SeeLearn is my beginner-accessible training platform for learning programming on various technologies.
fr: SeeLearn est ma plate-forme de formation accessible aux débutant permettant l’apprentissage de la programmation sur diverses technologies.

# trainingsYouTube
source: I offer, on my Youtube channel free training allowing developers of all levels to train on various technologies.
fr: Je propose, sur ma chaine Youtube des formations gratuite permettant à des développeurs de tout niveau de se former sur diverses technologies.

source: website
fr: site web

# welcome
source: Welcome to seekode App !
fr: Bienvenue sur l'application seekode !

source: My projects
fr: Mes projets

# expSubtitleSeekode
source: Front-End Developer
fr: Développeur Front-End

# expDescriptionSeekode
source: After having kept the same website for a long time which was modern and sober but a bit "classic", I wanted to completely redo my personal website with a more creative approach in order to give it a new look and make it stand out more easily.
fr: Après avoir longtemps gardé le même site web qui était moderne et sobre mais un peut "classique", j'ai voulu refaire entièrement mon site web personnel avec une approche plus créative afin de lui redonner un coup de neuf et qu'il se démarque plus facilement.

# expSubtitleFormawave
source: Full-Stack Trainer
fr: Formateur Full-Stack

# expDescriptionFormawave
source: Since December 2021, in addition to my usual clients, I have been working in collaboration with Formawave, an agency that regularly calls on me for missions as a trainer for beginner to advanced levels.
fr: Depuis décembre 2021, en plus de mes clients habituels, je travaille en collaboration avec Formawave, une agence qui fait régulièrement appel à moi pour des missions en tant que formateur pour des niveaux débutant à avancé.

# expSubtitleCapters
source: Full-Stack Developer
fr: Développeur Full-Stack

# expDescriptionCapters
source: As part of a mobile app called Capters, I was first asked to create a full admin interface. Following the customer's satisfaction, he contacted me again to fix bugs, performance issues and design new features on his mobile applications.
fr: Dans le cadre d'une application mobile appelée Capters, j'ai d'abord été demandé pour créer une interface administrateur complète. Suite à la satisfaction du client, il m'a recontacté pour résoudre des bugs, des problèmes de performance et concevoir de nouvelles fonctionnalités sur ses applications mobiles.

# expSubtitleCaptersAdmin
source: Full-Stack Developer
fr: Développeur Full-Stack

# expDescriptionSCaptersAdmin
source: As part of a mobile app called Capters, I helped my client by creating a full admin interface allowing them to moderate their apps. Once the admin interface was finished, I was in charge of maintenance, and updates adding various features for more than a year.
fr: Dans le cadre d'une application mobile appelée Capters, j'ai aidé mon client en créant une interface administrateur complète lui permettant de modérer ses applications. Une fois l'interface administrateur finit, j'etais en charge de la maintenance, et des mises a jours ajoutant diverses fonctionnalités pendant plus d'un ans.

# expSubtitleControlling
source: Full-Stack Developer
fr: Développeur Full-Stack

# expDescriptionControlling
source: I helped a freelance client improve the design and SEO of her website in order to boost her freelancing activities and allow her to get more clients. I also gave him a lot of advice on how to improve his web presence.
fr: J'ai aidé une cliente freelance à améliorer le design et le référencement de son site web afin de booster ses activités de freelance et lui permettre d'obtenir plus de clients. Je lui ai également apporté de nombreux conseils pour améliorer sa présence sur le Web.

# expSubtitleTennisVexinThelle
source: Full-Stack Trainer/Developer
fr: Formateur/Développeur Full-Stack

# expDescriptionTennisVexinThelle
source: As part of a training course, a learner had to create a website for his tennis club. I coached, advised and helped this learner to design his website himself and to be able to make others afterwards.
fr: Dans le cadre d'une formation, un apprenant devait réaliser un site Web pour son club de tennis. J'ai coaché, conseillé et aidé cet apprenant pour concevoir son site web lui-même et pouvoir en faire d'autres par la suite.

# expSubtitleDesmarez
source: Front-End Developer
fr: Développeur Front-End

# expDescriptionDesmarez
source: As part of an internship at DESMAREZ (2 internships of 1 month) I had the opportunity to briefly rub shoulders with the C++ language but above all I was in charge of producing an Android application capable of geolocating posts in real time.
fr: Dans le cadre d'un stage effectuer à DESMAREZ (2 stage de 1 mois) j'ai eu l'occasion de côtoyer brièvement le langage C++ mais surtout j'ai été charger de produire une applications Android capable de géolocaliser les posts en temps réel.

# expSubtitleSophrologie
source: Front-End Developer
fr: Développeur Front-End

# expDescriptionSophrologie
source: A client working in the field of sophrology as a freelancer contacted me in order to improve her web presence with a website, all for a reduced cost. So I offered him a 100% customized solution that fit within his budget.
fr: Une cliente travaillant dans le domaine de la sophrologie en freelance m'a contacté afin d'améliorer sa présence sur le web avec un site web, le tous pour un cout réduit. Je lui ai donc proposé une solution 100% customisée qui rentrait dans son budget.
